function Privacy(){
    return(
        <div>   
            <span> 
                개인정보처리방침
제1조 (개인정보의 처리 목적)
'노플랜(NOPLAN)'(이하 '회사')은(는) 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.

홈페이지 회원 가입 및 관리
회원 가입 의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 만 14세 미만 아동의 개인정보 처리 시 법정대리인의 동의여부 확인, 각종 고지·통지, 고충처리 목적으로 개인정보를 처리합니다.

재화 또는 서비스 제공
맞춤형 여행 코스 추천, 콘텐츠 제공, 맞춤형 서비스 제공, 포인트 적립 및 결제·정산 목적으로 개인정보를 처리합니다.

제2조 (처리하는 개인정보 항목)
회사는 다음의 개인정보 항목을 처리하고 있습니다.

일반 회원가입 시 수집 항목

필수항목: 아이디, 비밀번호, 이름, 연락처(휴대전화번호), 이메일, 닉네임, 생년월일, 성별, 여행 스타일(J/P)

소셜 로그인(카카오, 네이버, 구글) 시 수집 항목

필수항목: 소셜 연동 식별자, 닉네임, 프로필 이미지, 연락처, 여행 스타일(J/P)

서비스 이용 과정에서 자동으로 생성되어 수집될 수 있는 항목

IP 주소, 쿠키, 서비스 이용 기록, 방문 기록, 불량 이용 기록

제3조 (개인정보의 처리 및 보유기간)
① 회사는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.
② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.

홈페이지 회원 가입 및 관리: 사업자/단체 홈페이지 탈퇴 시까지
다만, 다음의 사유에 해당하는 경우에는 해당 사유 종료 시까지

관계 법령 위반에 따른 수사·조사 등이 진행 중인 경우에는 해당 수사·조사 종료 시까지

홈페이지 이용에 따른 채권·채무관계 잔존 시에는 해당 채권·채무관계 정산 시까지

재화 또는 서비스 제공: 재화·서비스 공급완료 및 요금결제·정산 완료 시까지
다만, 「전자상거래 등에서의 소비자 보호에 관한 법률」 등 관계 법령에 따라 보존할 필요가 있는 경우에는 해당 법령에서 정한 기간 동안 보존합니다.

제4조 (개인정보의 파기절차 및 파기방법)
① 회사는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.
② 파기절차 및 방법은 다음과 같습니다.

파기절차: 이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다.

파기방법: 전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.

제5조 (정보주체와 법정대리인의 권리·의무 및 행사방법)
① 정보주체는 회사에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다.
② 권리 행사는 회사에 대해 「개인정보 보호법」 시행령 제41조 제1항에 따라 서면, 전자우편 등을 통하여 하실 수 있으며, 회사는 이에 대해 지체없이 조치하겠습니다.

제6조 (개인정보의 안전성 확보조치)
회사는 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.

관리적 조치: 내부관리계획 수립·시행, 정기적 직원 교육

기술적 조치: 개인정보처리시스템 등의 접근권한 관리, 접근통제시스템 설치, 고유식별정보 등의 암호화, 보안프로그램 설치

제7조 (개인정보 보호책임자)
① 회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
▶ 개인정보 보호책임자
성명: [박휘선]
직책: 대표
연락처: [010-2378-8279], [shake923@gmail.com]

② 정보주체는 회사의 서비스를 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다.

제8조 (개인정보 처리방침 변경)
이 개인정보 처리방침은 2026년 3월 23일부터 적용됩니다.
 </span>
            
        </div>
    )
}

export default Privacy;